# Practice_Part_07: Data Grouping and Aggregation

In [42]:
import pandas as pd

#### Exercise_01
For the titanic data present in 'data/titanic':
1. Group the titanic data based on 'sex' column and find the mean age of the male and female passengers
2. Use the indexing method to find the mean age istead of using the groupby method
3. Group the data based on 'sex' column, and find the number of male and female passengers survived
4. Count the number of passengers survived and not-survived based on the gender, and cross check the result
5. Group the data based on the column 'sex' and iterate over the key and data

In [ ]:
df = pd.read_csv('data/titanic/original_titanic.csv')
df

In [44]:
group = df['age'].groupby(by=df['sex'])
group

In [45]:
group.mean()

sex
female    28.687088
male      30.585228
Name: age, dtype: float64

In [46]:
df['age'][df['sex']=='male'].mean()

30.58522796352583

In [47]:
df['age'][df['sex']=='female'].mean()

28.68708762886598

In [48]:
g_sex_age=df['survived'].groupby(by=df['sex'])
g_sex_age

In [49]:
g_sex_age.sum()

sex
female    339
male      161
Name: survived, dtype: int64

In [50]:
df.groupby(by=['sex','survived']).size()

sex     survived
female  0           127
        1           339
male    0           682
        1           161
dtype: int64

In [51]:
grouped = df.groupby(by='sex')
for key,data in grouped:
    print(key)
    print(data)

female
      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
2          1         0                     Allison, Miss. Helen Loraine
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
6          1         1                Andrews, Miss. Kornelia Theodosia
8          1         1    Appleton, Mrs. Edward Dale (Charlotte Lamson)
...      ...       ...                                              ...
1286       3         1  Whabee, Mrs. George Joseph (Shawneene Abi-Saab)
1290       3         1                 Wilkes, Mrs. James (Ellen Needs)
1300       3         1          Yasbeck, Mrs. Antoni (Selini Alexander)
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine

         sex   age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0      0      0   24160  211.3375       B5        S    2
2     female   2.0      1      2  113781  151.5500  C22 C26        S  NaN
4     female  25.0      1      2  113781  151.5500  C22 C26        S  NaN
6     female  63.0      1      0   13502   77.9583       D7        S   10
8     female  53.0      2      0   11769   51.4792     C101        S    D
...      ...   ...    ...    ...     ...       ...      ...      ...  ...
1286  female  38.0      0      0    2688    7.2292      NaN        C    C
1290  female  47.0      1      0  363272    7.0000      NaN        S  NaN
1300  female  15.0      1      0    2659   14.4542      NaN        C  NaN
1304  female  14.5      1      0    2665   14.4542      NaN        C  NaN
1305  female   NaN      1      0    2665   14.4542      NaN        C  NaN

       body                        home.dest
0       NaN                     St Louis, MO
2       NaN  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
6       NaN                       Hudson, NY
8       NaN              Bayside, Queens, NY
...     ...                              ...
1286    NaN                              NaN
1290    NaN                              NaN
1300    NaN                              NaN
1304  328.0                              NaN
1305    NaN                              NaN

[466 rows x 14 columns]
male
      pclass  survived                                  name   sex    age  \
1          1         1        Allison, Master. Hudson Trevor  male   0.92
3          1         0  Allison, Mr. Hudson Joshua Creighton  male  30.00
5          1         1                   Anderson, Mr. Harry  male  48.00
7          1         0                Andrews, Mr. Thomas Jr  male  39.00
9          1         0               Artagaveytia, Mr. Ramon  male  71.00
...      ...       ...                                   ...   ...    ...
1302       3         0                     Yousif, Mr. Wazli  male    NaN
1303       3         0                 Yousseff, Mr. Gerious  male    NaN
1306       3         0             Zakarian, Mr. Mapriededer  male  26.50
1307       3         0                   Zakarian, Mr. Ortin  male  27.00
1308       3         0                    Zimmerman, Mr. Leo  male  29.00

      sibsp  parch    ticket      fare    cabin embarked boat   body  \
1         1      2    113781  151.5500  C22 C26        S   11    NaN
3         1      2    113781  151.5500  C22 C26        S  NaN  135.0
5         0      0     19952   26.5500      E12        S    3    NaN
7         0      0    112050    0.0000      A36        S  NaN    NaN
9         0      0  PC 17609   49.5042      NaN        C  NaN   22.0
...     ...    ...       ...       ...      ...      ...  ...    ...
1302      0      0      2647    7.2250      NaN        C  NaN    NaN
1303      0      0      2627   14.4583      NaN        C  NaN    NaN
1306      0      0      2656    7.2250      NaN        C  NaN  304.0
1307      0      0      2670    7.2250      NaN        C  NaN    NaN
1308      0      0    315082    7.8750      NaN        S  NaN    NaN

                            home.dest
1     Montreal, PQ / Chesterville, ON
3     Montreal, PQ / Chesterville, ON
5                        New York, NY
7                         Belfast, NI
9                 Montevideo, Uruguay
...                               ...
1302                              NaN
1303                              NaN
1306                              NaN
1307                              NaN
1308                              NaN

[843 rows x 14 columns]

#### Exercise_02
1. Group the titanic data along the column, and iterate over the key and data 
2. Group the titanic data based on ['pclass', 'survived', 'sex'] and count the number of passengers survived on each type of 'pclass'
3. Use the 'survived' data as the list of values to find the total number of passengers survived using groupby method
4. Group the titanic data based on ['sex', 'name'] and find the total number of people survived
5. Find the most used type of 'embarked' by the passengers
6. Find the maximum age and the maximum pclass type
7. Find the top 'cabins' in the titanic ship using describe method on the column 'cabin'

In [52]:
for datatype,data in df.groupby(by=df.dtypes, axis=1):
    print(datatype)
    print(data)

int64
      pclass  survived  sibsp  parch
0          1         1      0      0
1          1         1      1      2
2          1         0      1      2
3          1         0      1      2
4          1         0      1      2
...      ...       ...    ...    ...
1304       3         0      1      0
1305       3         0      1      0
1306       3         0      0      0
1307       3         0      0      0
1308       3         0      0      0

[1309 rows x 4 columns]
float64
        age      fare   body
0     29.00  211.3375    NaN
1      0.92  151.5500    NaN
2      2.00  151.5500    NaN
3     30.00  151.5500  135.0
4     25.00  151.5500    NaN
...     ...       ...    ...
1304  14.50   14.4542  328.0
1305    NaN   14.4542    NaN
1306  26.50    7.2250  304.0
1307  27.00    7.2250    NaN
1308  29.00    7.8750    NaN

[1309 rows x 3 columns]
object
                                                 name     sex  ticket  \
0                       Allen, Miss. Elisabeth Walton  female   24160
1                      Allison, Master. Hudson Trevor    male  113781
2                        Allison, Miss. Helen Loraine  female  113781
3                Allison, Mr. Hudson Joshua Creighton    male  113781
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  113781
...                                               ...     ...     ...
1304                             Zabour, Miss. Hileni  female    2665
1305                            Zabour, Miss. Thamine  female    2665
1306                        Zakarian, Mr. Mapriededer    male    2656
1307                              Zakarian, Mr. Ortin    male    2670
1308                               Zimmerman, Mr. Leo    male  315082

        cabin embarked boat                        home.dest
0          B5        S    2                     St Louis, MO
1     C22 C26        S   11  Montreal, PQ / Chesterville, ON
2     C22 C26        S  NaN  Montreal, PQ / Chesterville, ON
3     C22 C26        S  NaN  Montreal, PQ / Chesterville, ON
4     C22 C26        S  NaN  Montreal, PQ / Chesterville, ON
...       ...      ...  ...                              ...
1304      NaN        C  NaN                              NaN
1305      NaN        C  NaN                              NaN
1306      NaN        C  NaN                              NaN
1307      NaN        C  NaN                              NaN
1308      NaN        S  NaN                              NaN

[1309 rows x 7 columns]

In [53]:
group_2=df[['pclass','survived','sex']].groupby(by='pclass')
group_2.sum()

        survived
pclass
1            200
2            119
3            181

In [54]:
df_survived = df['survived'].groupby(by=df['survived']).sum()
df_survived

survived
0      0
1    500
Name: survived, dtype: int64

In [63]:
df_index = df.set_index(['sex','name'])

In [67]:
df_survived_1 = df_index[['survived']].groupby(level='sex',axis=0).sum()
df_survived_1

        survived
sex
female       339
male         161

In [68]:
df['embarked'].value_counts()

S    914
C    270
Q    123
Name: embarked, dtype: int64

In [69]:
df[['age','pclass']].max()

age       80.0
pclass     3.0
dtype: float64

In [70]:
df['cabin'].describe()

count             295
unique            186
top       C23 C25 C27
freq                6
Name: cabin, dtype: object